In [2]:
import pandas as pd
import numpy as ny
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
path=r"C:\Users\Jayanth\Data science\python sheets\Visadataset.csv"
visa_df=pd.read_csv(path)
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [4]:
dict1={'Names':['Ramesh','Suresh',ny.nan,'Mahesh'],
      'Age':[23,24,25,ny.nan],
      'City':[ny.nan,'Hyd','Mumbai','Chennai']}

In [5]:
data1=pd.DataFrame(dict1)

In [6]:
data1.isnull()  # True in data frame means there is a null value in that place

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [7]:
data1.isnull().sum() #every column has one missing value

Names    1
Age      1
City     1
dtype: int64

In [8]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [9]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[23,24,25,None],
      'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)   # nan because of int type and  others are categorical data

In [10]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [11]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[23,24,25,'null'],
      'City':['Null','Hyd','Mumbai','Chennai']}
data3=pd.DataFrame(dict3)

In [12]:
data3.isnull() # not working because it is in string.

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [13]:
data3

    Names   Age     City
0  Ramesh    23     Null
1  Suresh    24      Hyd
2    Null    25   Mumbai
3  Mahesh  null  Chennai

**Method-1**

>Fill null missing values with random number

dataframename =data1

methodname:fillna

In [14]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  23.0       40
1  Suresh  24.0      Hyd
2      40  25.0   Mumbai
3  Mahesh  40.0  Chennai

**method-2**

>Fill null missing values with random number on specific column

dataframename =data1

methodname:fillna

In [15]:
data1['Names'].fillna('satish',inplace=True)
data1

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2  satish  25.0   Mumbai
3  Mahesh   NaN  Chennai

In [16]:
#create data again
dict1={'Names':['Ramesh','Suresh',ny.nan,'Mahesh'],
      'Age':[23,24,25,ny.nan],
      'City':[ny.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

In [17]:
data1

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2     NaN  25.0   Mumbai
3  Mahesh   NaN  Chennai

**method-3**

-bfill

-ffill

-pad

-backfill

In [18]:
data1.fillna(method='backfill')
# in the names index 2 is missed value
# it will replace by index 3 value
# age index 3 is missed value 
# we dont have index 4 , so the value is nan
# city index 0 has missed value
# it replaced with index 1 value

    Names   Age     City
0  Ramesh  23.0      Hyd
1  Suresh  24.0      Hyd
2  Mahesh  25.0   Mumbai
3  Mahesh   NaN  Chennai

In [19]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  23.0      Hyd
1  Suresh  24.0      Hyd
2  Mahesh  25.0   Mumbai
3  Mahesh   NaN  Chennai

In [20]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2  Suresh  25.0   Mumbai
3  Mahesh  25.0  Chennai

In [33]:
data1

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2     NaN  25.0   Mumbai
3  Mahesh   NaN  Chennai

In [21]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2  Suresh  25.0   Mumbai
3  Mahesh  25.0  Chennai

- bfill and backfill both are same
- pad and ffill both are same

**method-4**

- mean
- median
- mode

In [22]:
data1

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2     NaN  25.0   Mumbai
3  Mahesh   NaN  Chennai

In [23]:
age_mean=data1['Age'].mean()
age_mean

24.0

In [24]:
data1['Age'].fillna(age_mean)

0    23.0
1    24.0
2    25.0
3    24.0
Name: Age, dtype: float64

In [25]:
# insted of providing a random number 
# we are filling with mean of the data

In [26]:
age_med=data1['Age'].median()
age_med

24.0

In [27]:
data1['Age'].fillna(age_med)

0    23.0
1    24.0
2    25.0
3    24.0
Name: Age, dtype: float64

In [28]:
# insted of providing a random number 
# we are filling with median of the data

In [29]:
# level 1:

**kNN imputer**

**method-5**

KNN: k nearest neighbours

- in the knn imputer insted of taking mean of all the values
- will chose neighbours data
- will take those mean only

**KNN imputer**

In [30]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[23.],
       [24.],
       [25.],
       [24.]])

In [32]:
data1

    Names   Age     City
0  Ramesh  23.0      NaN
1  Suresh  24.0      Hyd
2     NaN  25.0   Mumbai
3  Mahesh   NaN  Chennai

**method-6**

- based on other columns
- some times all above ethods not provide good justification
- at that time we need to cheak other columns dependency
- most of the time will pick a column which have highest corelation